CREATE TABLE shelter
(
    name        TEXT,
    type        TEXT PRIMARY KEY,
    description TEXT,
    instruction TEXT
);
INSERT INTO shelter (name, description, type, instruction)
VALUES ('Собачье сердце', 'Наш приют для собак называется "Собачье сердце" и находится по адресу ул. Щербакова, 23, г. Город X
Приют работает круглосуточно, чтобы принимать и ухаживать за животными в любое удобное время для их хозяев.
Как добраться до приюта: можно доехать на автобусе № 15 и выйти на остановке "Щербакова", затем пройти по улице еще примерно 200 метров в сторону центра города.\n\n
Перед посещением приюта важно ознакомиться с правилами техники безопасности. Сотрудники приюта рекомендуют заходить на территорию только после предварительного звонка или записи на прием, чтобы избежать перегрузки в приюте. Также нужно соблюдать основные правила поведения с животными и не приносить на территорию приюта еду для собак без предварительного согласования.\n\n
В приюте "Собачье сердце" собакам обеспечивают качественный уход, включая ежедневные прогулки и кормление. Здесь можно выбрать нового друга-собаку и даже поучаствовать в организации благотворительных мероприятий в пользу животных.\n\n
Для оформления пропуска заранее оставьте свои данные на пункт охраны, тел. +7-000-00-00 ', 'DOG', 'Правила знакомства с животным до того, как забрать его из приюта:

    1. Позаботьтесь о том, чтобы у вас было достаточно времени для адаптации животного к новым условиям.
    2. Обязательно посетите приют, чтобы познакомиться с потенциальным новым членом вашей семьи.
    3. Спросите у персонала приюта об особенностях привычек собаки и о ее особенностях характера.
    4. Удостоверьтесь, что у вас и у членов вашей семьи нет аллергии на животных.

Список документов, необходимых для того, чтобы взять животное из приюта:
    1. Паспорт Российской Федерации.

Список рекомендаций по транспортировке животного:
    1. Проверьте требования перевозчика на транспортировку животных.
    2. Необходимо выбрать специальный контейнер, чтобы животное было в безопасности. Материал контейнера должен быть крепким и легким.
    3. Контейнер должен быть достаточно большим, чтобы животное могло свободно двигаться и поворачиваться, но в то же время достаточно маленьким, чтобы не осложнять перевозку в транспорте.
    4. Во время транспортировки животное не должно оставаться без присмотра. Вам необходимо следить за здоровьем, еде, воде и поведением животного.
    5. Контейнер должен быть соответствующе обозначен, чтобы работники транспортной компании могли легко идентифицировать связанных с перевозкой животных.
    6. Вы должны предоставить все документы на перевозимых животных и договориться об условиях перевозки.
    7. Нельзя оставлять животных в машине на протяжении длительного времени, особенно в жаркую погоду.
    8. Необходимо учесть все особенности своего животного и обеспечить ему максимальный комфорт во время перевозки.

Список рекомендаций по обустройству дома для щенка:
    1. Создайте безопасную зону для щенка, где он будет чувствовать себя комфортно и не будет беспокоиться о своей безопасности. Например, это может быть зона в комнате с перегородкой или забором.
    2. Подготовите уютное место для сна, где собака будет чувствовать себя комфортно.
    3. Проверьте, нет ли опасных для щенка предметов на полу или доступных местах. Убедитесь, что химические продукты, лекарства и остроугольные предметы находятся в недоступных для щенка местах.
    4. Убедитесь, что в доме достаточное количество воды для щенка. Постоянный доступ к воде и организованное питание помогут поддерживать здоровье и хорошее настроение щенка.
    5. Обустройте жилую зону таким образом, чтобы щенок мог двигаться по дому свободно и безопасно.
    6. Регулярно оставляйте щенка без присмотра в доме, чтобы он мог изучать окружающую обстановку, но только в том случае, если вы уверены в его безопасности, лучше всего оставлять животное в большой обустроенной клетке или вольере для его безопсности.
    7. Закупитесь пеленками на первое время,  они вам будут необходимы.
    8. Миски должны быть изготовлены из материалов безопасных для здоровья собаки, размер посуды и её место должны соответствовать размерам и породе собаки.

Список рекомендаций по обустройству дома для взрослой собаки:

    1. Подготовите уютное место для сна, где собака будет чувствовать себя комфортно.
    2. Миски должны быть изготовлены из материалов безопасных для здоровья собаки, размер посуды и её место должны соответствовать размерам и породе собаки.
    3. Нужны игрушки для собаки, такие как мячи, кости, игрушки на веревке и другие. Они помогут занять собаку и предотвратить скучность.
    4. Необходим пуходер для ухода за шерстью собаки. Это также снижает риск развития болезней кожи.
    5. Собачий гамак или багажник может понадобится для безопасной и удобной перевозки собаки.
    6. Клетка или переноска для временного содержания собаки, например, во время поездки или при посещении ветеринара.


Список рекомендаций по обустройству дома для животного с ограниченными возможностями (зрение, передвижение)

    1. Необходимо сделать дом безопасным для животного, установив противоскользящие коврики на полу, чтобы избежать падений и травм.
    2. Если животное имеет ограниченное зрение, необходимо установить яркие и контрастные светильники по всему дому, чтобы улучшить его видимость.
    3. Для улучшения передвижения животного оборудовать свободное пространство для передвижения.
    4. Животному с ограниченными возможностями необходимо оборудовать удобное место для отдыха и сна, например, мягкий лежак с подушками и одеялами.
    5. Необходимо убрать все острые и опасные предметы, чтобы дом был безопасным для животного.
    6. Необходимо держать еду и воду в удобном месте, чтобы животное могло добраться до них без проблем.
    7. Для социализации с другими животными или людьми, животному с ограниченными возможностями может понадобиться специальное обучение, поэтому необходимо обратиться к ветеринару для получения рекомендаций.
советы кинолога по первичному общению с собакой
    1. Не навязывайте свое общение сразу после знакомства. Дайте собаке время понять, что вы не являетесь угрозой.
    2. Не трогайте собаку сразу. Позвольте ей подойти к вам и нюхнуть вас.
    3. Говорите с собакой мягким и утвердительным голосом. Не кричите на нее и не использовайте громкие звуки.
    4. Избегайте быстрых движений и резких жестов. Они могут напугать собаку.
    5. Не давайте собаке свой еду до того, как установится доверительный контакт.
    6. Не поднимайте и не качайте собаку за шею или уши. Это может вызвать боль и привести к агрессивной реакции.
    7. Подходите к собаке с боку, а не спереди. Это позволяет ей чувствовать себя более комфортно.
    8. Будьте внимательны к языку тела собаки. Так вы смежите понять , что собака чувствует.

Существует несколько причин, по которым приют может отказать в выдаче собаки:

1. Не соответствующие условия проживания. Если вы живете в небольшой квартире или у вас нет забора в частном доме, приют может отказать в выдаче собаки, которая требует большого пространства или может легко сбежать.

2. Необходимый опыт и знания. Если вы никогда не воспитывали собаку или не знаете, как правильно ухаживать за ней, приют может отказать вам, чтобы предотвратить возможные проблемы в будущем и защитить жизнь животного.

3. Финансовые ограничения. Если вы не можете позволить себе содержать и ухаживать за собакой, приют может отказать вам, чтобы предотвратить потенциальную негативную ситуацию, в которой животное может страдать.

4. Несоответствие задачам и потребностям животного. Если вы ищете собаку для совместного жилья, а приют видит, что животное ищет другую задачу, приют может отказать вам, чтобы защитить жизнь и благосостояние животного.

В каждом случае причина отказа является защитой жизней животных и человека.
'),
    ('Кошачье сердце', 'Наш приют для кошек, который находится в городе Голденхилл на улице Кошачьей Милости, 20, называется «Кошачье сердце». Приют работает ежедневно с 9 утра до 6 вечера.
Схема проезда до приюта такая: с центральной площади Голденхилла нужно свернуть на улицу Бартелл и ехать прямо до остановки "Прекрасная кошка". Далее нужно повернуть на улицу Кошачьей Милости и проехать еще 100 метров. Приют находится на правой стороне дороги, имеет котаную вывеску и большой забор.
Для техники безопасности на территории приюта рекомендуется соблюдать следующие правила:
    1. Нужно точно следовать инструкциям и указаниям персонала.
    2. Нельзя кормить животных из рук, без разрешения персонала.
    3. Нужно бережно обращаться с животными и не дразнить их.
    4. Нельзя проникать на территорию приюта после закрытия, без разрешения персонала.
Приют для кошек - это уютное место, где животные получают помощь и любовь от персонала и волонтеров. Он очень важен для всех животных, потому что предоставляет им дом и заботу в трудный период их жизни. Если вы заинтересованы в волонтерстве, вы можете связаться с приютом и узнать о возможностях помощи.
Для оформления пропуска заранее оставьте свои данные на пункт охраны, тел. +7-000-00-00 ', 'CAT', 'Правила знакомства с животным до того, как забрать его из приюта:

    5. Позаботьтесь о том, чтобы у вас было достаточно времени для адаптации животного к новым условиям.
    6. Обязательно посетите приют, чтобы познакомиться с потенциальным новым членом вашей семьи.
    7. Спросите у персонала приюта об особенностях привычек кошки и о ее особенностях характера.
    8. Удостоверьтесь, что у вас и у членов вашей семьи нет аллергии на животных.

Список документов, необходимых для того, чтобы взять животное из приюта:
    1. Паспорт Российской Федерации.

Список рекомендаций по транспортировке животного:
    1. Проверьте требования перевозчика на транспортировку животных.
    2. Необходимо выбрать специальный контейнер, чтобы животное было в безопасности. Материал контейнера должен быть крепким и легким.
    3. Контейнер должен быть достаточно большим, чтобы животное могло свободно двигаться и поворачиваться, но в то же время достаточно маленьким, чтобы не осложнять перевозку в транспорте.
    4. Во время транспортировки животное не должно оставаться без присмотра. Вам необходимо следить за здоровьем, еде, воде и поведением животного.
    5. Контейнер должен быть соответствующе обозначен, чтобы работники транспортной компании могли легко идентифицировать связанных с перевозкой животных.
    6. Вы должны предоставить все документы на перевозимых животных и договориться об условиях перевозки.
    7. Нельзя оставлять животных в машине на протяжении длительного времени, особенно в жаркую погоду.
    8. Необходимо учесть все особенности своего животного и обеспечить ему максимальный комфорт во время перевозки.

Список рекомендаций по обустройству дома для щенка:
    1. Создайте безопасную зону для котенка, где он будет чувствовать себя комфортно и не будет беспокоиться о своей безопасности.
    2. Подготовите уютное место для сна, где котенок будет чувствовать себя комфортно.
    3. Проверьте, нет ли опасных для котенка предметов на полу или доступных местах. Убедитесь, что химические продукты, лекарства и остроугольные предметы находятся в недоступных для щенка местах.
    4. Убедитесь, что в доме достаточное количество воды  и еды для котенка. Постоянный доступ к воде и организованное питание помогут поддерживать здоровье и хорошее настроение котенка.
    5. Обустройте жилую зону таким образом, чтобы котенок мог двигаться по дому свободно и безопасно.
    6. Регулярно оставляйте щенка без присмотра в доме, чтобы он мог изучать окружающую обстановку, но только в том случае, если вы уверены в его безопасности.

    7. Миски должны быть изготовлены из материалов безопасных для здоровья котенка.

Список рекомендаций по обустройству дома для взрослой собаки:

    1. Подготовите уютное место для сна, где кошка будет чувствовать себя комфортно.
    2. Миски должны быть изготовлены из материалов безопасных для здоровья.
    3. Необходим пуходер для ухода за шерстью котенка. Это также снижает риск развития болезней кожи.


Список рекомендаций по обустройству дома для животного с ограниченными возможностями (зрение, передвижение)

    1. Необходимо сделать дом безопасным для животного, установив противоскользящие коврики на полу, чтобы избежать падений и травм.
    2. Если животное имеет ограниченное зрение, необходимо установить яркие и контрастные светильники по всему дому, чтобы улучшить его видимость.
    3. Для улучшения передвижения животного оборудовать свободное пространство для передвижения.
    4. Животному с ограниченными возможностями необходимо оборудовать удобное место для отдыха и сна, например, мягкий лежак с подушками и одеялами.
    5. Необходимо убрать все острые и опасные предметы, чтобы дом был безопасным для животного.
    6. Необходимо держать еду и воду в удобном месте, чтобы животное могло добраться до них без проблем.
    7. Для социализации с другими животными или людьми, животному с ограниченными возможностями может понадобиться специальное обучение, поэтому необходимо обратиться к ветеринару для получения рекомендаций.
    8.
Существует несколько причин, по которым приют может отказать в выдаче собаки:

1. Не соответствующие условия проживания. Если вы живете в небольшой квартире или у вас нет забора в частном доме, приют может отказать в выдаче собаки, которая требует большого пространства или может легко сбежать.

2. Необходимый опыт и знания. Если вы никогда не воспитывали собаку или не знаете, как правильно ухаживать за ней, приют может отказать вам, чтобы предотвратить возможные проблемы в будущем и защитить жизнь животного.

3. Финансовые ограничения. Если вы не можете позволить себе содержать и ухаживать за собакой, приют может отказать вам, чтобы предотвратить потенциальную негативную ситуацию, в которой животное может страдать.

4. Несоответствие задачам и потребностям животного. Если вы ищете собаку для совместного жилья, а приют видит, что животное ищет другую задачу, приют может отказать вам, чтобы защитить жизнь и благосостояние животного.

В каждом случае причина отказа является защитой жизней животных и человека.');

CREATE TABLE usr
(
    id      BIGINT PRIMARY KEY,
    name    TEXT,
    email   TEXT,
    phone   TEXT,
    chatId  BIGINT,
    reports TEXT
);

CREATE TABLE report
(
    id         BIGINT,
    user_id    BIGINT,
    reportText TEXT
)